       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACC-PROCESSOR.
       AUTHOR. VAULT-AI.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RESPONSE-CODE    PIC 9(02) VALUE 0.
       01  WS-TOTAL-INTEREST   PIC 9(09)V99 VALUE 0.
       
       COPY "ACCOUNT-REC.cpy".

       PROCEDURE DIVISION.
       0000-MAIN-PROCESS.
           DISPLAY "PROCESING ACCOUNT: " ACC-NUMBER.
           PERFORM 1100-VALIDATE-STATUS.
           PERFORM 1200-CALC-INTEREST.
           STOP RUN.

       1100-VALIDATE-STATUS.
           IF ACC-ACTIVE
               DISPLAY "ACCOUNT STATUS IS ACTIVE"
           ELSE
               DISPLAY "ACCOUNT IS NON-ACTIVE"
               SET WS-RESPONSE-CODE TO 99
           END-IF.

       1200-CALC-INTEREST.
           COMPUTE WS-TOTAL-INTEREST = ACC-BALANCE * 0.05.
           DISPLAY "INTEREST CALCULATED: " WS-TOTAL-INTEREST.
